vignettes/user-heaven.org
#+TITLE: R-package heaven
#+superman-export-target: html

* About

The R package =heaven= is the natural response to the legendary
=code-from-hell.sas=. Heaven includes a series of function that are
useful when working with Danish registry data (on the Gentofte
servers) on Denmark Statistics.

- You should know some =data.table= because data on Denmark Statistics are large
- Thanks to Jesper Lindhardsen and Anders Munch for their work on =importSAS= 
- Complain to Thomas Alexander Gerds and Christian Tobias Torp-Pedersen

* Ordnung muss sein

There is a function to help you set up a clean project:
 
#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R :exports code :results output raw  :session *R* :cache yes 
library(heaven)
createProject("v:/data/workdata/701234/BlaBlaBla/study")
#+END_SRC
  
* R user heaven

** Raw data import

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R :exports code :results output raw  :session *R* :cache yes 
listRawdata()
scanRawdata()
dc <- contentSAS("x:/data/rawdata_hurtig/701234/diag")
d10 <- importSAS("x:/data/rawdata_hurtig/701234/diag",obs=10)
#+END_SRC

** More soon
