vignettes/user-heaven.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-11 Thu 11:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>R-package heaven</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Thomas Alexander Gerds" />
<link rel="stylesheet" type="text/css" href="https://publicifsv.sund.ku.dk/~tag/styles/practicals.css" />
</head>
<body>
<div id="content">
<h1 class="title">R-package heaven</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org82d04d7">1. About</a></li>
<li><a href="#org76cde11">2. Ordnung muss sein</a></li>
<li><a href="#orgaf44c1b">3. R user heaven</a>
<ul>
<li><a href="#org0e5da66">3.1. Raw data import</a></li>
<li><a href="#orgc72ee60">3.2. More soon</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org82d04d7" class="outline-2">
<h2 id="org82d04d7"><span class="section-number-2">1</span> About</h2>
<div class="outline-text-2" id="text-1">
<p>
The R package <code>heaven</code> is the natural response to the legendary
<code>code-from-hell.sas</code>. Heaven includes a series of function that are
useful when working with Danish registry data (on the Gentofte
servers) on Denmark Statistics.
</p>

<ul class="org-ul">
<li>You should know some <code>data.table</code> because data on Denmark Statistics are large</li>
<li>Thanks to Jesper Lindhardsen and Anders Munch for their work on <code>importSAS</code></li>
<li>Complain to Thomas Alexander Gerds and Christian Tobias Torp-Pedersen</li>
</ul>
</div>
</div>

<div id="outline-container-org76cde11" class="outline-2">
<h2 id="org76cde11"><span class="section-number-2">2</span> Ordnung muss sein</h2>
<div class="outline-text-2" id="text-2">
<p>
There is a function to help you set up a clean project:
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #008b8b;">library</span>(heaven)
createProject(<span style="color: #8b2252;">"v:/data/workdata/701234/BlaBlaBla/study"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf44c1b" class="outline-2">
<h2 id="orgaf44c1b"><span class="section-number-2">3</span> R user heaven</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org0e5da66" class="outline-3">
<h3 id="org0e5da66"><span class="section-number-3">3.1</span> Raw data import</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-R">listRawdata()
scanRawdata()
dc <span style="color: #008b8b;">&lt;-</span> contentSAS(<span style="color: #8b2252;">"x:/data/rawdata_hurtig/701234/diag"</span>)
d10 <span style="color: #008b8b;">&lt;-</span> importSAS(<span style="color: #8b2252;">"x:/data/rawdata_hurtig/701234/diag"</span>,obs=10)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc72ee60" class="outline-3">
<h3 id="orgc72ee60"><span class="section-number-3">3.2</span> More soon</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
Last update: 11 Apr 2019 by Thomas Alexander Gerds.
</div>
</body>
</html>
